app/views/donors/show.html.erb

SELECT COUNT(*) FROM "donors"
---
    <li><a href="/donors/<%= p (@donor.id - 1) unless @donor.id == 1 %>">Önceki</a></li>
    <li><a href="/donors/<%= p (@donor.id + 1) if @donor.id < Donor.count  %>">Sonraki</a></li>