app/controllers/bagiscis_controller.rb

SELECT "bagiscis".* FROM "bagiscis"
---
  def index
    @bagiscis = Bagisci.all

SELECT "bagiscis".* FROM "bagiscis" WHERE "bagiscis"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @bagisci = Bagisci.find(params[:id])

INSERT INTO "bagiscis" ("bagiszaman", "created_at", "kanGrubu", "lastname", "name", "tcno", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @bagisci = Bagisci.new(params[:bagisci])

    respond_to do |format|
      if @bagisci.save

SELECT "bagiscis".* FROM "bagiscis" WHERE "bagiscis"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "bagiscis" WHERE "bagiscis"."id" = ?  [["id", 2]]
---
  def destroy
    @bagisci = Bagisci.find(params[:id])
    @bagisci.destroy