app/controllers/donors_controller.rb

  def show
    @donor = Donor.find(params[:id])
---
SELECT "donors".* FROM "donors" WHERE "donors"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @donor = Donor.new(params[:donor])

    if @donor.save
---
INSERT INTO "donors" ("bloodGroup", "bloodType", "created_at", "donateTime", "lastname", "location", "name", "password", "password_digest", "password_digst", "tcNo", "tel", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @donor = Donor.find(params[:id])
---
SELECT "donors".* FROM "donors" WHERE "donors"."id" = 9 LIMIT 1

  def update
        @donor = Donor.find(params[:id])
    if @donor.update_attributes(params[:donor])
---
SELECT "donors".* FROM "donors" WHERE "donors"."id" = ? LIMIT 1  [["id", "9"]]
UPDATE "donors" SET "password_digest" = '$2a$10$Lz/mabs4IgJsXGSfs22YveJtMfZiUHMES5a2AEbY8Xw9qsOdPm41a', "updated_at" = '2014-12-24 18:55:31.843371' WHERE "donors"."id" = 9