app/controllers/sessions_controller.rb

SELECT "donors".* FROM "donors" WHERE "donors"."tcNo" = 12345678924 LIMIT 1
---
  def create
    donor = Donor.where(tcNo: params[:session][:tcNo]).first